<template>
  <div class="nearly">
    <!-- <div class="single" v-for="(m,index) in nearmessage" :key="index" >
    </div> -->
    <div class="single" v-for="m in nearmessage" :key="m.id">
      <div class="title">
        <span>博客标题{{m.title}}</span>
      </div>
      <div class="content">
        <!-- 跳转到详情路由，并将数据传过去 -->
        <router-link :to="{name:'single',params:{userId:m.userId,title:m.title,body:m.body}}" @click="read">{{m.body}}</router-link>
      </div>
      
    </div>
  </div>
</template>

<script>
import {mapState} from 'vuex'
export default {
  name:'Nearly',
  data(){
    return {
        nearmessage:[{userId:'zlx',id:1,title:'你好呀',body:'对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于，今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于'},{id:2,title:'你好呀ya',body:'对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于，今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于'},{id:3,title:'你好呀yaya',body:'对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于，今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于今天天气很冷，冷的瑟瑟发抖，但是又不想船舵几件，穿鞋子算了，有点冷啊，年对于星球，对于宇宙也就眨眼间，而对人类却是无比漫长。经过千年的发展，地球在也不再是是人类唯一的栖息地。科技的发展让人类的眼界再次扩大，宇宙之外还有许多宇宙，我们对于宇宙外的统称为宙外。自从公元2222年开始，人类的科技再次发生“大爆炸”，发现了反万有引力、负磁场和虫洞等革命性的物理定律。虫洞在当前科技下只能在两个恒星系之间建立，最远可达20光年，因此通过不断建立虫洞，人类的足迹遍布在银河系的绝大部分星球上，几个星球或几十上百个星球联合形成一个个星球联盟，地球就属于'}]//存放前几条数据
    }
  },
  methods: {
    read(){
      // window.scrollTo(0,0)跳转返回顶部未解决
    }
  },
  computed:{
    //数据里有用户id：userid,唯一标识id，标题：title 内容：body
    ...mapState(['message'])
  },
  watch:{
    message(newvalue){
      return this.nearmessage=newvalue.slice(0,8)
    }
  }
}
</script>

<style scoped>
.nearly{
    padding: 20px;
}
.single{
  height: 250px;
  
  margin-bottom: 20px;
}
.single .title{
  margin-bottom: 15px;
  display: flex;
  justify-content: center;
}
.single .title span{
  font-size: 25px;
  color: #4169e1
}
.single .content a{
  display:-webkit-box;
  background: #40e0d0;
  border-radius: 8px;
  font-size: 18px;
  color:#333;
  text-decoration: none;
  text-indent: 2em;
  /* 文字超出隐藏 */
  overflow: hidden;
  text-overflow: ellipsis;
  -webkit-line-clamp: 8;
  -webkit-box-orient: vertical;
}
</style>